# Making an precise dataset

In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
df=pd.read_csv('car_trade_data.csv')
df.head()

,Unnamed: 0,Car Price,Car Name,City Name,Fuel type,Kilometer ran,Color,Owner type,Year of manufacture
0,0,5.65 Lakh,Used Hyundai Grand i10 in Kanpur,Kanpur,Petrol,"9,400 Kms",White,First,2019
1,1,4 Lakh,Used Hyundai i10 [2010-2017] in Hyderabad,Hyderabad,Petrol,"67,971 Kms",Maroon,First,2014
2,2,34.75 Lakh,Used MINI Countryman [2015-2018] in Mumbai,Mumbai,Diesel,"18,500 Kms",Grey,First,2018
3,3,12.58 Lakh,Used Mercedes-Benz C-Class [2010-2011] in Mumbai,Mumbai,Petrol,"66,700 Kms",White,First,2011
4,4,8 Lakh,Used BMW 5 Series [2007-2010] in Thane,Thane,Diesel,"1,17,123 Kms",Black,First,2008

In [4]:
df1=df.copy()

In [5]:
df1.columns

Index(['Unnamed: 0', 'Car Price', 'Car Name', 'City Name', 'Fuel type',
       'Kilometer ran', 'Color', 'Owner type', 'Year of manufacture'],
      dtype='object')

In [6]:
df1.drop('Unnamed: 0',axis=1,inplace=True)

In [7]:
df1.head()

,Car Price,Car Name,City Name,Fuel type,Kilometer ran,Color,Owner type,Year of manufacture
0,5.65 Lakh,Used Hyundai Grand i10 in Kanpur,Kanpur,Petrol,"9,400 Kms",White,First,2019
1,4 Lakh,Used Hyundai i10 [2010-2017] in Hyderabad,Hyderabad,Petrol,"67,971 Kms",Maroon,First,2014
2,34.75 Lakh,Used MINI Countryman [2015-2018] in Mumbai,Mumbai,Diesel,"18,500 Kms",Grey,First,2018
3,12.58 Lakh,Used Mercedes-Benz C-Class [2010-2011] in Mumbai,Mumbai,Petrol,"66,700 Kms",White,First,2011
4,8 Lakh,Used BMW 5 Series [2007-2010] in Thane,Thane,Diesel,"1,17,123 Kms",Black,First,2008

**cleaning car price column**

In [19]:
pd.set_option('display.max_rows',None)

In [23]:
df1['Car Price'].replace(['1.25 Crore ','1.47 Crore','1.75 Crore','1.55 Crore','1.21 Crore','1.1 Crore','1.65 Crore','2.7 Crore','1.62 Crore','1.14 Crore','2.35 Crore'],[12500000,14700000,17500000,15500000,12100000,11000000,16500000,27000000,16200000,11400000,23500000],inplace=True)

In [58]:
df1['Car Price'].replace(['1.25 Crore','95,000','90,000','85,000','99,000','65,000','60,000','97,000','52,000','98,000'],[12500000,95000,90000,85000,99000,65000,60000,97000,52000,98000],inplace=True)

In [88]:
list1=[]
for i in df1['Car Price']:
    if type(i)==int:
        list1.append(i)
    else:
        k=i.split(' ')
        k1=float(k[0])
        k2=k1*10000
        k3=int(k2)
        list1.append(k3)

In [89]:
df1.drop('Car Price',axis=1,inplace=True)

In [90]:
df1['Car Price']=list1

In [91]:
df1.head()

,Car Name,City Name,Fuel type,Kilometer ran,Color,Owner type,Year of manufacture,Car Price
0,Used Hyundai Grand i10 in Kanpur,Kanpur,Petrol,"9,400 Kms",White,First,2019,56500
1,Used Hyundai i10 [2010-2017] in Hyderabad,Hyderabad,Petrol,"67,971 Kms",Maroon,First,2014,40000
2,Used MINI Countryman [2015-2018] in Mumbai,Mumbai,Diesel,"18,500 Kms",Grey,First,2018,347500
3,Used Mercedes-Benz C-Class [2010-2011] in Mumbai,Mumbai,Petrol,"66,700 Kms",White,First,2011,125800
4,Used BMW 5 Series [2007-2010] in Thane,Thane,Diesel,"1,17,123 Kms",Black,First,2008,80000

In [93]:
df1.dtypes

Car Name               object
City Name              object
Fuel type              object
Kilometer ran          object
Color                  object
Owner type             object
Year of manufacture     int64
Car Price               int64
dtype: object

**Cleaning car name column**

In [105]:
listn=[]
for i in df1['Car Name']:
    k=re.sub(r'^Used','',i)
    k1=k.split(' ')
    k2=k1[:-1]
    k3=' '.join(k2)
    k4=re.sub(r'in$','',k3)
    k5=re.sub("\[.*?\]",'',k4)
    listn.append(k5)

In [121]:
#still in some of the cars name in followed by place name is there, through this function we are removing that
listn1=[]
for i in df1['Car Name']:
    test_str =i
    sub_str = "in"
    def check(test_str, sub_str):
        if (test_str.find(sub_str) == -1):
            listn1.append(test_str)
        else:
            res = test_str[:test_str.index(sub_str) + len(sub_str)]
            listn1.append(str(res))
    check(test_str, sub_str)

In [130]:
# In some of the name contains in at last , we have to remove that
listn2=[]
for i in listn1:
    k1=re.sub(r'in$','',i)
    listn2.append(k1)

In [133]:
df1.drop('Car Name',axis=1,inplace=True)

In [134]:
df1['Car Name']=listn2

In [144]:
df1['Car Name'].replace('Mah','Mahendra',inplace=True)

In [145]:
df1.drop('one',axis=1,inplace=True)

In [147]:
df1.head()

,City Name,Fuel type,Kilometer ran,Color,Owner type,Year of manufacture,Car Price,Car Name
0,Kanpur,Petrol,"9,400 Kms",White,First,2019,56500,Hyundai Grand i10
1,Hyderabad,Petrol,"67,971 Kms",Maroon,First,2014,40000,Hyundai i10
2,Mumbai,Diesel,"18,500 Kms",Grey,First,2018,347500,MINI Countryman
3,Mumbai,Petrol,"66,700 Kms",White,First,2011,125800,Mercedes-Benz C-Class
4,Thane,Diesel,"1,17,123 Kms",Black,First,2008,80000,BMW 5 Series

**Cleaning Kilometer ran column**

In [148]:
df1['Kilometer ran'] = df1['Kilometer ran'].str.replace(r'\D', '').astype(int)

<ipython-input-148-56374540cdec>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df1['Kilometer ran'] = df1['Kilometer ran'].str.replace(r'\D', '').astype(int)

In [149]:
df1.head()

,City Name,Fuel type,Kilometer ran,Color,Owner type,Year of manufacture,Car Price,Car Name
0,Kanpur,Petrol,9400,White,First,2019,56500,Hyundai Grand i10
1,Hyderabad,Petrol,67971,Maroon,First,2014,40000,Hyundai i10
2,Mumbai,Diesel,18500,Grey,First,2018,347500,MINI Countryman
3,Mumbai,Petrol,66700,White,First,2011,125800,Mercedes-Benz C-Class
4,Thane,Diesel,117123,Black,First,2008,80000,BMW 5 Series

In [151]:
df1.dtypes

City Name              object
Fuel type              object
Kilometer ran           int32
Color                  object
Owner type             object
Year of manufacture     int64
Car Price               int64
Car Name               object
dtype: object

In [154]:
df1['Fuel type'].value_counts()

Diesel      3021
Petrol      2891
CNG           69
LPG            7
Hybrid         3
Electric       2
Name: Fuel type, dtype: int64

In [155]:
df1.to_csv('Second Car Price.csv')